In [24]:
import numpy as np
import pandas as pd
import matplotlib as plt

In [2]:
df = pd.read_csv("https://raw.githubusercontent.com/prof-tcsmith/data_repo/master/660920411.csv")

In [10]:
df

             X1        X2          X3         X4         Y
0      9.914035  5.998939  13698.6531 -2152.1342  11706.34
1     10.033271  5.997209  10126.1947 -2076.9239   8123.67
2           NaN  5.999991   9471.5393 -2092.2243   7431.68
3      9.998073  5.994168  14476.9058 -1884.7939  12496.47
4      9.869646  5.990580   8206.4659 -2327.1395   5785.47
...         ...       ...         ...        ...       ...
2453   9.847819  5.996710   9724.8080 -1982.9469   7762.75
2454   9.922070  5.998028  11083.4290        NaN   9111.46
2455  10.035305  5.995905   7922.2543 -2065.4919   5684.33
2456  10.104343  5.987137         NaN -2019.9270   8737.72
2457  10.031330  5.999383  13488.5037 -1806.6586  11686.27

[2458 rows x 5 columns]

In [20]:
df.describe()

                X1           X2            X3           X4             Y
count  2177.000000  2186.000000   2195.000000  2195.000000   2160.000000
mean      9.999180     5.995155   9977.532422 -1979.998653   8027.914819
std       0.100671     0.006787   2027.208147   200.188337   2047.905498
min       9.678028     5.914573   4304.024600 -2665.308100   2091.490000
25%       9.931051     5.993364   8577.663050 -2115.908100   6610.565000
50%       9.999162     5.997761   9863.980700 -1975.894700   7924.990000
75%      10.067261     5.999486  11283.100150 -1844.619250   9346.955000
max      10.353330     6.000000  20121.499700 -1350.601700  17742.360000

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2458 entries, 0 to 2457
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   X1      2177 non-null   float64
 1   X2      2186 non-null   float64
 2   X3      2195 non-null   float64
 3   X4      2195 non-null   float64
 4   Y       2160 non-null   float64
dtypes: float64(5)
memory usage: 96.1 KB

In [7]:
df.columns

Index(['X1', 'X2', 'X3', 'X4', 'Y'], dtype='object')

In [12]:
df['X1'].info()

<class 'pandas.core.series.Series'>
RangeIndex: 2458 entries, 0 to 2457
Series name: X1
Non-Null Count  Dtype
--------------  -----
2177 non-null   float64
dtypes: float64(1)
memory usage: 19.3 KB

In [14]:
df['X1'].describe()

count    2177.000000
mean        9.999180
std         0.100671
min         9.678028
25%         9.931051
50%         9.999162
75%        10.067261
max        10.353330
Name: X1, dtype: float64

In [22]:
df['X2'].describe()

count    2186.000000
mean        5.995155
std         0.006787
min         5.914573
25%         5.993364
50%         5.997761
75%         5.999486
max         6.000000
Name: X2, dtype: float64

In [23]:
df.isnull().sum()

X1    281
X2    272
X3    263
X4    263
Y     298
dtype: int64

In [26]:
Y_after_drop=df['Y'].dropna()

In [27]:
Y_after_drop.info()

<class 'pandas.core.series.Series'>
Int64Index: 2160 entries, 0 to 2457
Series name: Y
Non-Null Count  Dtype
--------------  -----
2160 non-null   float64
dtypes: float64(1)
memory usage: 33.8 KB

In [34]:
x1=df['X1'].dropna()
x2=df['X2'].dropna()
x3=df['X3'].dropna()
x4=df['X4'].dropna()
y=df['Y'].dropna()

In [30]:
x1.info()

<class 'pandas.core.series.Series'>
Int64Index: 2177 entries, 0 to 2457
Series name: X1
Non-Null Count  Dtype
--------------  -----
2177 non-null   float64
dtypes: float64(1)
memory usage: 34.0 KB

In [31]:
x2.info()

<class 'pandas.core.series.Series'>
Int64Index: 2186 entries, 0 to 2457
Series name: X2
Non-Null Count  Dtype
--------------  -----
2186 non-null   float64
dtypes: float64(1)
memory usage: 34.2 KB

In [32]:
x3.info()

<class 'pandas.core.series.Series'>
Int64Index: 2195 entries, 0 to 2457
Series name: X3
Non-Null Count  Dtype
--------------  -----
2195 non-null   float64
dtypes: float64(1)
memory usage: 34.3 KB

In [33]:
x4.info()

<class 'pandas.core.series.Series'>
Int64Index: 2195 entries, 0 to 2457
Series name: X4
Non-Null Count  Dtype
--------------  -----
2195 non-null   float64
dtypes: float64(1)
memory usage: 34.3 KB

In [36]:
y.info()

<class 'pandas.core.series.Series'>
Int64Index: 2160 entries, 0 to 2457
Series name: Y
Non-Null Count  Dtype
--------------  -----
2160 non-null   float64
dtypes: float64(1)
memory usage: 33.8 KB

In [40]:
df.dropna()

             X1        X2          X3         X4         Y
0      9.914035  5.998939  13698.6531 -2152.1342  11706.34
1     10.033271  5.997209  10126.1947 -2076.9239   8123.67
3      9.998073  5.994168  14476.9058 -1884.7939  12496.47
4      9.869646  5.990580   8206.4659 -2327.1395   5785.47
5      9.921237  5.989397  10837.2486 -1857.5226   9081.10
...         ...       ...         ...        ...       ...
2450   9.928563  5.988500   7671.1155 -2394.2838   5284.98
2451  10.009444  5.999904  11401.6934 -1813.5977   9668.13
2453   9.847819  5.996710   9724.8080 -1982.9469   7762.75
2455  10.035305  5.995905   7922.2543 -2065.4919   5684.33
2457  10.031330  5.999383  13488.5037 -1806.6586  11686.27

[1507 rows x 5 columns]

In [39]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2458 entries, 0 to 2457
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   X1      2177 non-null   float64
 1   X2      2186 non-null   float64
 2   X3      2195 non-null   float64
 3   X4      2195 non-null   float64
 4   Y       2160 non-null   float64
dtypes: float64(5)
memory usage: 96.1 KB

In [48]:
df.replace(0,'NaN')

             X1        X2          X3         X4         Y
0      9.914035  5.998939  13698.6531 -2152.1342  11706.34
1     10.033271  5.997209  10126.1947 -2076.9239   8123.67
2           NaN  5.999991   9471.5393 -2092.2243   7431.68
3      9.998073  5.994168  14476.9058 -1884.7939  12496.47
4      9.869646  5.990580   8206.4659 -2327.1395   5785.47
...         ...       ...         ...        ...       ...
2453   9.847819  5.996710   9724.8080 -1982.9469   7762.75
2454   9.922070  5.998028  11083.4290        NaN   9111.46
2455  10.035305  5.995905   7922.2543 -2065.4919   5684.33
2456  10.104343  5.987137         NaN -2019.9270   8737.72
2457  10.031330  5.999383  13488.5037 -1806.6586  11686.27

[2458 rows x 5 columns]

In [49]:
from sklearn.model_selection import train_test_split

In [54]:
X2_train,X2_test=train_test_split(df['X2'],test_size=0.2,random_state=1)

1268    5.998795
2269    5.993482
1617    5.991795
499     5.983469
535     5.999547
          ...
1384    5.997259
1655    5.998893
572     5.997760
893     5.985312
2203    5.992545
Name: X2, Length: 492, dtype: float64

In [56]:
X2_train,X2_test=train_test_split(df,test_size=0.3,random_state=1)

In [62]:
X2_test.describe()

               X1          X2            X3           X4             Y
count  641.000000  638.000000    648.000000   655.000000    634.000000
mean     9.995932    5.995107  10087.604822 -1980.865189   8129.502918
std      0.101933    0.006881   2064.907433   201.773172   2067.257912
min      9.678028    5.953098   5061.006100 -2567.889800   2905.070000
25%      9.925910    5.993385   8683.775425 -2110.212400   6705.657500
50%      9.994136    5.997737   9974.487000 -1981.919700   7959.455000
75%     10.063929    5.999466  11383.643100 -1850.637700   9480.870000
max     10.311294    6.000000  16441.105800 -1350.601700  14451.650000

In [63]:
X2_train.describe()

                X1           X2            X3           X4             Y
count  1536.000000  1548.000000   1547.000000  1540.000000   1526.000000
mean     10.000535     5.995175   9931.425818 -1979.630094   7985.708493
std       0.100143     0.006749   2010.090471   199.575155   2039.004067
min       9.730586     5.914573   4304.024600 -2665.308100   2091.490000
25%       9.932508     5.993354   8526.560300 -2116.425350   6564.527500
50%      10.000442     5.997768   9852.008300 -1973.881700   7920.450000
75%      10.068875     5.999498  11219.450000 -1842.849525   9326.847500
max      10.353330     6.000000  20121.499700 -1376.897300  17742.360000

In [61]:
df.describe()

                X1           X2            X3           X4             Y
count  2177.000000  2186.000000   2195.000000  2195.000000   2160.000000
mean      9.999180     5.995155   9977.532422 -1979.998653   8027.914819
std       0.100671     0.006787   2027.208147   200.188337   2047.905498
min       9.678028     5.914573   4304.024600 -2665.308100   2091.490000
25%       9.931051     5.993364   8577.663050 -2115.908100   6610.565000
50%       9.999162     5.997761   9863.980700 -1975.894700   7924.990000
75%      10.067261     5.999486  11283.100150 -1844.619250   9346.955000
max      10.353330     6.000000  20121.499700 -1350.601700  17742.360000